load-test.yml
config:
  # Target server
  target: "http://localhost:8000"
  
  # Phases - gradually ramp up to 200 users
  phases:
    - duration: 30
      arrivalRate: 1
      name: "Warm up - 1 user"
    
    - duration: 60
      arrivalRate: 2
      rampTo: 10
      name: "Ramp up to 10 users"
    
    - duration: 60
      arrivalRate: 10
      rampTo: 30
      name: "Ramp up to 30 users"
    
    - duration: 120
      arrivalRate: 30
      rampTo: 50
      name: "Ramp up to 50 users"
    
    - duration: 120
      arrivalRate: 50
      rampTo: 100
      name: "Ramp up to 100 users"
    
    - duration: 180
      arrivalRate: 100
      rampTo: 200
      name: "Ramp up to 200 users (FULL LOAD)"
    
    - duration: 300
      arrivalRate: 200
      name: "Sustain 200 concurrent users"
    
    - duration: 60
      arrivalRate: 100
      rampTo: 50
      name: "Ramp down to 50 users"

  # Report settings
  report:
    - "summary"
    - "stats"
    - "json"
  
  # Ensure we track detailed metrics
  variables:
    baseUrl: "http://localhost:8000"
    apiVersion: "v1"
  
  # Processor for custom functions
  processor: "./load-test-processor.js"
  
  # Custom HTTP settings
  http:
    timeout: 10
    maxErrorRetries: 0

# Test scenarios
scenarios:
  # ============================================================================
  # SCENARIO 1: Student Authentication & Chat
  # ============================================================================
  - name: "Student - Auth & Chat Flow"
    weight: 40
    flow:
      - post:
          url: "/api/{{ apiVersion }}/student-auth/login"
          json:
            email: "student{{ $randomNumber(1, 100) }}@example.com"
            password: "password123"
          capture:
            json: "$.data.accessToken"
            as: "studentToken"
          expect:
            - statusCode: 200
          timeout: 5

      - think: 2

      # Get conversations
      - get:
          url: "/api/{{ apiVersion }}/chat/conversations"
          headers:
            Authorization: "Bearer {{ studentToken }}"
          expect:
            - statusCode: 200
          timeout: 5

      - think: 1

      # Send encrypted message
      - post:
          url: "/api/{{ apiVersion }}/chat/messages"
          headers:
            Authorization: "Bearer {{ studentToken }}"
            Content-Type: "application/json"
          json:
            conversationId: "conv-{{ $randomString(24) }}"
            recipientId: "admin-{{ $randomString(24) }}"
            recipientType: "Admin"
            encryptedForRecipient:
              ciphertext: "encrypted-text-{{ $randomString(50) }}"
              iv: "{{ $randomString(16) }}"
              salt: "{{ $randomString(16) }}"
            encryptedForSender:
              ciphertext: "encrypted-text-{{ $randomString(50) }}"
              iv: "{{ $randomString(16) }}"
              salt: "{{ $randomString(16) }}"
          expect:
            - statusCode: 201
          timeout: 5

      - think: 1

      # Get public key
      - get:
          url: "/api/{{ apiVersion }}/chat/keys/Admin/admin-{{ $randomString(24) }}"
          headers:
            Authorization: "Bearer {{ studentToken }}"
          expect:
            - statusCode: 200
          timeout: 5

      - think: 2

  # ============================================================================
  # SCENARIO 2: Admin Operations
  # ============================================================================
  - name: "Admin - Dashboard & Operations"
    weight: 30
    flow:
      - post:
          url: "/api/{{ apiVersion }}/admin/login"
          json:
            email: "admin@example.com"
            password: "admin123"
          capture:
            json: "$.data.accessToken"
            as: "adminToken"
          expect:
            - statusCode: 200
          timeout: 5

      - think: 1

      # Get student list
      - get:
          url: "/api/{{ apiVersion }}/students?page=1&limit=20"
          headers:
            Authorization: "Bearer {{ adminToken }}"
          expect:
            - statusCode: 200
          timeout: 5

      - think: 2

      # Get notifications
      - get:
          url: "/api/{{ apiVersion }}/notification/history?limit=50"
          headers:
            Authorization: "Bearer {{ adminToken }}"
          expect:
            - statusCode: 200
          timeout: 5

      - think: 1

      # Mark notification as read
      - patch:
          url: "/api/{{ apiVersion }}/notification/read/notif-{{ $randomString(24) }}"
          headers:
            Authorization: "Bearer {{ adminToken }}"
          expect:
            - statusCode: 200
          timeout: 5

      - think: 2

  # ============================================================================
  # SCENARIO 3: Heavy Chat Load (Multiple Messages)
  # ============================================================================
  - name: "Heavy Chat Load - Rapid Messages"
    weight: 20
    flow:
      - post:
          url: "/api/{{ apiVersion }}/student-auth/login"
          json:
            email: "chatuser{{ $randomNumber(1, 50) }}@example.com"
            password: "password123"
          capture:
            json: "$.data.accessToken"
            as: "chatToken"
          expect:
            - statusCode: 200
          timeout: 5

      - think: 1

      # Send 5 messages rapidly
      - loop:
          - post:
              url: "/api/{{ apiVersion }}/chat/messages"
              headers:
                Authorization: "Bearer {{ chatToken }}"
                Content-Type: "application/json"
              json:
                conversationId: "conv-{{ $randomString(24) }}"
                recipientId: "admin-{{ $randomString(24) }}"
                recipientType: "Admin"
                encryptedForRecipient:
                  ciphertext: "msg-{{ $loopCount }}-{{ $randomString(40) }}"
                  iv: "{{ $randomString(16) }}"
                  salt: "{{ $randomString(16) }}"
                encryptedForSender:
                  ciphertext: "msg-{{ $loopCount }}-{{ $randomString(40) }}"
                  iv: "{{ $randomString(16) }}"
                  salt: "{{ $randomString(16) }}"
              expect:
                - statusCode: 201
              timeout: 3
          count: 5

      - think: 2

  # ============================================================================
  # SCENARIO 4: Notification Heavy Load
  # ============================================================================
  - name: "Notification Heavy Load"
    weight: 10
    flow:
      - post:
          url: "/api/{{ apiVersion }}/student-auth/login"
          json:
            email: "notifuser{{ $randomNumber(1, 50) }}@example.com"
            password: "password123"
          capture:
            json: "$.data.accessToken"
            as: "notifToken"
          expect:
            - statusCode: 200
          timeout: 5

      - think: 1

      # Get notifications multiple times
      - loop:
          - get:
              url: "/api/{{ apiVersion }}/notification/history?limit=100"
              headers:
                Authorization: "Bearer {{ notifToken }}"
              expect:
                - statusCode: 200
              timeout: 3
          count: 3

      - think: 1

      # Mark multiple notifications as read
      - loop:
          - patch:
              url: "/api/{{ apiVersion }}/notification/read/notif-{{ $randomString(24) }}"
              headers:
                Authorization: "Bearer {{ notifToken }}"
              expect:
                - statusCode: 200
              timeout: 2
          count: 5

      - think: 2